ZanthusXMLConverter/ZanthusXMLConverter/Requests/merc_search_request.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:managerIntegracao">
	<soapenv:Header/>
	<soapenv:Body>
		<urn:metodoIntegracaoGenerico soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<str_xml xsi:type="xsd:string">
				<![CDATA[<?xml version="1.0" encoding="UTF-8"?>
					<ZMI>
						<DATABASES>
							<DATABASE>
								<COMMANDS>
									<SELECT>
										<MERCADORIAS>
											<MERCADORIA>
												<FIELD NAME='COD_LOJA'/>
												<FIELD NAME='COD_MERCADORIA'/>
												<FIELD NAME='DESCRICAO'/>
												<FIELD NAME='COD_DEPARTAMENTO'/>
												<FIELD NAME='COD_MERCADORIA_ASSOCIADA'/>
												<FIELD NAME='UNIDADE_VENDA'/>
												<FIELD NAME='QUANTIDADE_EMBALAGEM'/>
												<FIELD NAME='INDICA_MERC_PESO_VARIAVEL'/>
												<FIELD NAME='PROIBE_VENDA_FRACIONADA'/>
												<FIELD NAME='DIAS_VALIDADE'/>
												<FIELD NAME='MODO_PRECO'/>
												<FIELD NAME='POSICAO_PRECO'/>
												<FIELD NAME='COD_SITUACAO_TRIBUTARIA'/>
												<FIELD NAME='COD_SIT_TRIB_ISS'/>
												<FIELD NAME='COD_TRIBUTACAO_MERCADORIA'/>
												<FIELD NAME='UNIDADE_TRIB'/>
												<FIELD NAME='QUANTIDADE_TRIB'/>
												<FIELD NAME='PERC_TRIBUTOS'/>
												<FIELD NAME='PERC_TRIBUTOS_MUNICIPAL'/>
												<FIELD NAME='PERC_TRIBUTOS_ESTADUAL'/>
												<FIELD NAME='PERC_TRIBUTOS_FEDERAL'/>
												<FIELD NAME='PVVM'/>
												<FIELD NAME='ISENTO_PIS_COFINS'/>
												<FIELD NAME='COD_SIT_TRIB_PIS'/>
												<FIELD NAME='COD_SIT_TRIB_PIS_PVVM'/>
												<FIELD NAME='ALIQUOTA_PIS'/>
												<FIELD NAME='PERC_SUBST_PIS'/>
												<FIELD NAME='PERC_REDUZ_B_CALCULO_PIS'/>
												<FIELD NAME='ALIQUOTA_VALOR_PIS'/>
												<FIELD NAME='COD_SIT_TRIB_COFINS'/>
												<FIELD NAME='COD_SIT_TRIB_COFINS_PVVM'/>
												<FIELD NAME='ALIQUOTA_COFINS'/>
												<FIELD NAME='PERC_SUBST_COFINS'/>
												<FIELD NAME='PERC_REDUZ_B_CALCULO_COFINS'/>
												<FIELD NAME='ALIQUOTA_VALOR_COFINS'/>
												<FIELD NAME='ALIQUOTA_INTERNA_ICMS'/>
												<FIELD NAME='PERC_SUBST_ICMS'/>
												<FIELD NAME='CUSTO_CONTABIL'/>
												<FIELD NAME='COD_NCM'/>
												<FIELD NAME='CEST'/>
												<FIELD NAME='CFOP'/>
												<FIELD NAME='FLGINATIVO'/>
												<FILTER FIELD='FLGINATIVO' TYPE='EQUAL'>
													<VALUE>1</VALUE>
												</FILTER>
											</MERCADORIA>
										</MERCADORIAS>
									</SELECT>
								</COMMANDS>
							</DATABASE>
						</DATABASES>
					</ZMI>
				]]>
			</str_xml>
		</urn:metodoIntegracaoGenerico>
	</soapenv:Body>
</soapenv:Envelope>
