ZanthusXMLConverter/Responses/request_filter.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:managerIntegracao">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:metodoIntegracaoGenerico soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <str_xml xsi:type="xsd:string">
                <![CDATA[<?xml version="1.0" encoding="UTF-8"?>
					<ZMI>
						<DATABASES>
							<DATABASE NAME="MANAGER" AUTOCOMMIT_VALUE="1000" AUTOCOMMIT_ENABLED="1" HALTONERROR="1">
								<COMMANDS>
									<REPLACE>
										<MERCADORIAS>
											<MERCADORIA>
												<COD_LOJA>1</COD_LOJA>
												<COD_MERCADORIA>6045</COD_MERCADORIA>
												<DESCRICAO>PAO BRIOCHE KG</DESCRICAO>
												<COD_DEPARTAMENTO>22</COD_DEPARTAMENTO>
												<FLGINATIVO>0</FLGINATIVO>
												<COD_TRIBUTACAO_MERCADORIA>4</COD_TRIBUTACAO_MERCADORIA>
												<INDICA_PESO_TARA>0</INDICA_PESO_TARA>
												<FLG_PRODUTO_CONTROLADO>128</FLG_PRODUTO_CONTROLADO>
												<COD_SITUACAO_TRIBUTARIA>060</COD_SITUACAO_TRIBUTARIA>
												<COD_SIT_TRIB_ISS>0</COD_SIT_TRIB_ISS>
												<CUSTO_CONTABIL>15.79</CUSTO_CONTABIL>
												<QUANTIDADE_EMBALAGEM>1</QUANTIDADE_EMBALAGEM>
												<DIAS_VALIDADE>5</DIAS_VALIDADE>
												<PROIBE_DESC_FUNCIONARIO>0</PROIBE_DESC_FUNCIONARIO>
												<PERC_TRIBUTOS>0</PERC_TRIBUTOS>
												<PERC_TRIBUTOS_ESTADUAL>0</PERC_TRIBUTOS_ESTADUAL>
												<PERC_TRIBUTOS_MUNICIPAL>0</PERC_TRIBUTOS_MUNICIPAL>
												<PERC_TRIBUTOS_FEDERAL>27.45</PERC_TRIBUTOS_FEDERAL>
												<ISENTO_PIS_COFINS>1</ISENTO_PIS_COFINS>
												<FABRICACAO_PROPRIA>0</FABRICACAO_PROPRIA>
												<INDICA_TRATAMENTO_VASILHAME>0</INDICA_TRATAMENTO_VASILHAME>
												<COD_NCM>19059090</COD_NCM>
												<!--
												enum unidadeVenda  {
													 "UN" => "Unidade",
													 "KG" => "Kilo",
													 "CX" => "Caixa",
													 "PC" => "Pacote",
													 "JG" => "Jogo",
													 "RL" => "Rolo"
												};
												-->
												<UNIDADE_VENDA>KG</UNIDADE_VENDA>
												<UNIDADE_TRIB>KG</UNIDADE_TRIB>
												<QUANTIDADE_TRIB>1</QUANTIDADE_TRIB>
												<POSICAO_PRECO>0</POSICAO_PRECO>
												<SELECAO_USO_VARIOS_PRECOS>0</SELECAO_USO_VARIOS_PRECOS>
												<CEST>1703600</CEST>
												<PROIBE_VENDA_FRACIONADA>0</PROIBE_VENDA_FRACIONADA>
												<INDICA_MERC_PESO_VARIAVEL>1</INDICA_MERC_PESO_VARIAVEL>
												<MODO_PRECO>1</MODO_PRECO>
												<COD_MERCADORIA_ASSOCIADA>0</COD_MERCADORIA_ASSOCIADA>
												<CONTROLA_DIGITACAO_QUANT>0</CONTROLA_DIGITACAO_QUANT>
												<PERMISSAO_VENDA>0</PERMISSAO_VENDA>
												<CFOP>5405</CFOP>
												<ALIQUOTA_INTERNA_ICMS>0</ALIQUOTA_INTERNA_ICMS>
												<PERC_REDUZ_B_CALCULO_PIS>0</PERC_REDUZ_B_CALCULO_PIS>
												<PERC_REDUZ_B_CALCULO_COFINS>0</PERC_REDUZ_B_CALCULO_COFINS>
												<ALIQUOTA_PIS>0</ALIQUOTA_PIS>
												<ALIQUOTA_COFINS>0</ALIQUOTA_COFINS>
												<PERC_SUBST_ICMS>0</PERC_SUBST_ICMS>
												<PERC_SUBST_PIS>0</PERC_SUBST_PIS>
												<PERC_SUBST_COFINS>0</PERC_SUBST_COFINS>
												<ALIQUOTA_VALOR_PIS>0</ALIQUOTA_VALOR_PIS>
												<ALIQUOTA_VALOR_COFINS>0</ALIQUOTA_VALOR_COFINS>
												<COD_SIT_TRIB_PIS>007</COD_SIT_TRIB_PIS>
												<COD_SIT_TRIB_PIS_PVVM>007</COD_SIT_TRIB_PIS_PVVM>
												<COD_SIT_TRIB_COFINS>007</COD_SIT_TRIB_COFINS>
												<COD_SIT_TRIB_COFINS_PVVM>007</COD_SIT_TRIB_COFINS_PVVM>
												<PVVM>0</PVVM>
											</MERCADORIA>
										</MERCADORIAS>
										<PRODUTOS>
											<PRODUTO>
												<COD_PRODUTO>6045</COD_PRODUTO>
												<DESCRICAO_PRODUTO>PAO BRIOCHE KG</DESCRICAO_PRODUTO>
											</PRODUTO>
										</PRODUTOS>
										<MERCADORIA_TIPO_VENDAS>
											<MERCADORIA_TIPO_VENDA>
												<USUARIO>Sistema</USUARIO>
												<COD_LOJA>1</COD_LOJA>
												<COD_MERCADORIA>6045</COD_MERCADORIA>
												<COD_TIPO_VENDA>1</COD_TIPO_VENDA>
												<PRECO_UNITARIO>19.5</PRECO_UNITARIO>
											</MERCADORIA_TIPO_VENDA>
										</MERCADORIA_TIPO_VENDAS>
										<MERCADORIA_TIPO_VENDAS>
											<MERCADORIA_TIPO_VENDA>
												<USUARIO>Sistema</USUARIO>
												<COD_LOJA>1</COD_LOJA>
												<COD_MERCADORIA>6045</COD_MERCADORIA>
												<COD_TIPO_VENDA>2</COD_TIPO_VENDA>
												<PRECO_UNITARIO>19.5</PRECO_UNITARIO>
											</MERCADORIA_TIPO_VENDA>
										</MERCADORIA_TIPO_VENDAS>
										<MERCADORIA_TIPO_VENDAS>
											<MERCADORIA_TIPO_VENDA>
												<USUARIO>Sistema</USUARIO>
												<COD_LOJA>1</COD_LOJA>
												<COD_MERCADORIA>6045</COD_MERCADORIA>
												<COD_TIPO_VENDA>3</COD_TIPO_VENDA>
												<PRECO_UNITARIO>19.5</PRECO_UNITARIO>
											</MERCADORIA_TIPO_VENDA>
										</MERCADORIA_TIPO_VENDAS>
										<MERCADORIA_TIPO_VENDAS>
											<MERCADORIA_TIPO_VENDA>
												<USUARIO>Sistema</USUARIO>
												<COD_LOJA>1</COD_LOJA>
												<COD_MERCADORIA>6045</COD_MERCADORIA>
												<COD_TIPO_VENDA>4</COD_TIPO_VENDA>
												<PRECO_UNITARIO>19.5</PRECO_UNITARIO>
											</MERCADORIA_TIPO_VENDA>
										</MERCADORIA_TIPO_VENDAS>
										<MERCADORIA_TIPO_VENDAS>
											<MERCADORIA_TIPO_VENDA>
												<USUARIO>Sistema</USUARIO>
												<COD_LOJA>1</COD_LOJA>
												<COD_MERCADORIA>6045</COD_MERCADORIA>
												<COD_TIPO_VENDA>5</COD_TIPO_VENDA>
												<PRECO_UNITARIO>19.5</PRECO_UNITARIO>
											</MERCADORIA_TIPO_VENDA>
										</MERCADORIA_TIPO_VENDAS>
									</REPLACE>
								</COMMANDS>
							</DATABASE>
						</DATABASES>
					</ZMI>
                ]]>
            </str_xml>
        </urn:metodoIntegracaoGenerico>
    </soapenv:Body>
</soapenv:Envelope>